src/ПодсистемаPAPI/InformationRegisters/PAPI_ВходящиеСообщенияСервисаИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>PAPI_ВходящиеСообщенияСервисаИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстаревания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщенияЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПрочитаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЧтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PAPI_ТипЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Примечание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/InformationRegisters/PAPI_ВходящиеСообщенияСервисаИнтеграции/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Добавить изменить запись
//
// Параметры:
//  СтруктураЗаписи	 - Структура - 
// 
// Возвращаемое значение:
//  Результат - Булево 
//
Функция ДобавитьИзменитьЗапись(СтруктураЗаписи, СтруктураСообщения, Создавать = Истина) Экспорт

	Результат = Ложь;
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;	 
	
	
	Если ТипЗнч(СтруктураЗаписи) <> Тип("Структура") Тогда
		
		ТекстОшибки = НСтр("ru = 'Запись не является Структурой'; en = 'Record is not a Structure'");		
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции");
		
		Возврат Результат; 
		
	КонецЕсли;
	
	Если Не СтруктураЗаписи.Свойство("Идентификатор") Тогда 
		
		ТекстОшибки = НСтр("ru = 'Отсутствует свойство ""Идентификатор""'; en = 'Identifier property is missing'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции");
		
		Возврат Результат;		
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураЗаписи.Идентификатор) Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Не заполнен ""Идентификатор""'; en = 'Identifier not filled in'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции");
		
		Возврат Результат;		
				
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Идентификатор.Установить(СтруктураЗаписи.Идентификатор);
	
	Если СтруктураЗаписи.Свойство("КодОтправителя") 
		И ЗначениеЗаполнено(СтруктураЗаписи.КодОтправителя)Тогда
		
		НаборЗаписей.Отбор.КодОтправителя.Установить(СтруктураЗаписи.КодОтправителя);
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Если Не Создавать Тогда 
			Возврат Истина;	
		КонецЕсли;	
		
		НоваяЗаписьРегистра = НаборЗаписей.Добавить(); 
		
		НоваяЗаписьРегистра.Сообщение = Новый ХранилищеЗначения(СтруктураСообщения);  
		
		МассивПолейРегистра = МассивПолейРегистра();		
	
	Иначе
				
		НоваяЗаписьРегистра = НаборЗаписей[0]; 
		
		МассивПолейРегистра = МассивПолейИзмененияРегистра();	
		
	КонецЕсли;
	
	Попытка
		
		Для Каждого элМассива Из МассивПолейРегистра Цикл 
				
			Если СтруктураЗаписи.Свойство(элМассива) Тогда
				
				НоваяЗаписьРегистра[элМассива] = СтруктураЗаписи[элМассива];
					
			КонецЕсли	
			
		КонецЦикла;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("PAPIОтключитьПодпискуПередЗаписью");
		
		НаборЗаписей.Записать();
		Результат = Истина;
		
	Исключение

		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции");						
					
	КонецПопытки;
		
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Удалить устаревшие записи
//
// Параметры: 
//  ДатаОтправки - Дата - Дата по которую следует удалить записи
// 
Процедура УдалитьУстаревшиеЗаписи(ДатаОтправки = Неопределено) Экспорт 
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	PAPI_ВходящиеСообщенияСервисаИнтеграции.Идентификатор КАК Идентификатор,
		|	PAPI_ВходящиеСообщенияСервисаИнтеграции.КодОтправителя КАК КодОтправителя
		|ИЗ
		|	РегистрСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции КАК PAPI_ВходящиеСообщенияСервисаИнтеграции
		|ГДЕ
		|	PAPI_ВходящиеСообщенияСервисаИнтеграции.ДатаОтправки <= &ДатаОтправки
		|	И PAPI_ВходящиеСообщенияСервисаИнтеграции.ДанныеПрочитаны";
	
	Если Не ЗначениеЗаполнено(ДатаОтправки) Тогда 
		ДатаОтправки = ТекущаяДатаСеанса(); 
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		НаборЗаписей = РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Идентификатор.Установить(ВыборкаДетальныеЗаписи.Идентификатор);
		НаборЗаписей.Отбор.КодОтправителя.Установить(ВыборкаДетальныеЗаписи.КодОтправителя);
		НаборЗаписей.Записать();    
		
	КонецЦикла;
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;

КонецПроцедуры


// Запустить повторную загрузку
//
// Параметры:
//  Идентификатор	 - УникальныйИдентификатор - Идентификатор входящего сообщения
//  КодОтправителя	 - Строка - Код отправителя
//
Процедура ЗапуститьПовторнуюЗагрузку(Идентификатор, КодОтправителя) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	PAPI_ВходящиеСообщенияСервисаИнтеграции.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции КАК PAPI_ВходящиеСообщенияСервисаИнтеграции
		|ГДЕ
		|	PAPI_ВходящиеСообщенияСервисаИнтеграции.Идентификатор = &Идентификатор
		|	И PAPI_ВходящиеСообщенияСервисаИнтеграции.КодОтправителя = &КодОтправителя
		|	И НЕ PAPI_ВходящиеСообщенияСервисаИнтеграции.ДанныеПрочитаны";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("КодОтправителя", КодОтправителя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураВходныхПараметров = ВыборкаДетальныеЗаписи.Сообщение.Получить();
		
		// TODO: Сделать в фоне?
		
		PAPI_РаботаСВходящимиСообщениями.ПодготовитьЧтениеИПрочитатьСообщение(СтруктураВходныхПараметров, Истина); 
		
	КонецЦикла;
		
КонецПроцедуры

// Массив полей регистра
// 
// Возвращаемое значение:
//  Массив - Поля заполняемые при создании записи
//
Функция МассивПолейРегистра()
	
	МассивПолейРегистра = Новый Массив;  
	
	// Измерения
	МассивПолейРегистра.Добавить("Идентификатор");
	МассивПолейРегистра.Добавить("КодОтправителя");
	
	// Стандартные свойства сообщения
	МассивПолейРегистра.Добавить("ДатаОтправки");
	МассивПолейРегистра.Добавить("ДатаУстаревания");
	//МассивПолейРегистра.Добавить("КодПолучателя");
	МассивПолейРегистра.Добавить("ИдентификаторСообщенияЗапроса");
	
	// Параметры с информацией по обмену
    МассивПолейРегистра.Добавить("ТипСообщения");
	МассивПолейРегистра.Добавить("ТипОбъекта");
	МассивПолейРегистра.Добавить("ИдОбъекта");
	МассивПолейРегистра.Добавить("Представление");
	МассивПолейРегистра.Добавить("ВидИзменения");
	
	// Отметка о прочтении
	МассивПолейРегистра.Добавить("ДанныеПрочитаны");
	МассивПолейРегистра.Добавить("ДатаЧтения"); 
	
	// Ошибка записи
	МассивПолейРегистра.Добавить("ТекстОшибки");
	
	Возврат МассивПолейРегистра;
	
КонецФункции

// Массив полей изменения регистра
// 
// Возвращаемое значение:
//  Массив - Поля заполняемые при создании записи 
//
Функция МассивПолейИзмененияРегистра()
	
	МассивПолейРегистра = Новый Массив;
	МассивПолейРегистра.Добавить("ДанныеПрочитаны");
	МассивПолейРегистра.Добавить("ДатаЧтения");
	
	МассивПолейРегистра.Добавить("ТекстОшибки");
	
	Возврат МассивПолейРегистра;
	
КонецФункции

#КонецОбласти
